etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/STM32_WPAN_BF/stm32_wpan_app_ble.cpp
/**
 ******************************************************************************
 * @file    app_ble.c
 * @author  MCD Application Team
 * @brief   BLE Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license SLA0044, the "License"; You may not use this
 * file except in compliance with the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/

#include "CR_Tasker.h"
#include "CR_Queue.h"
#include "Timers_Lib.h"
#include "hci_tl.h"
#include "ble_gap_aci.h"
#include "ble_gatt_aci.h"
#include "ble_l2cap_aci.h"
#include "ble_hci_le.h"
#include "ble_hal_aci.h"
#include "Prod_Spec_APP.h"
#include "BLE_DCI_Interface.h"
#include "BLE_Stack_Interface.h"
#include "stm32_wpan_entry.h"
#include "stm32wbxx_hal.h"
#include "app_conf.h"
#include "ble.h"
#include "tl.h"
#include "shci.h"
#include "otp.h"
#include "stm32_wpan_app_Ble.h"

/* Private typedef -----------------------------------------------------------*/


static uint8_t const* m_ad_data = nullptr;
static uint8_t m_ad_data_size = 0U;
static uint8_t m_device_name_length = 0U;
static const char* m_device_name = nullptr;
static SHCI_C2_Ble_Init_Cmd_Packet_t* m_ble_init_cmd_packet = nullptr;


/**
 * security parameters structure
 */
typedef struct _tSecurityParams
{
	/**
	 * IO capability of the device
	 */
	uint8_t ioCapability;

	/**
	 * Authentication requirement of the device Man In the Middle protection required?
	 */
	uint8_t mitm_mode;

	/**
	 * bonding mode of the device
	 */
	uint8_t bonding_mode;

	/**
	 * Flag to tell whether OOB data has to be used during the pairing process
	 */
	uint8_t OOB_Data_Present;

	/**
	 * OOB data to be used in the pairing process if OOB_Data_Present is set to TRUE
	 */
	uint8_t OOB_Data[16];

	/**
	 * this variable indicates whether to use a fixed pin during the pairing process or a passkey has to be requested to
	 * the application during the pairing process 0 implies use fixed pin and 1 implies request for passkey
	 */
	uint8_t Use_Fixed_Pin;

	/**
	 * minimum encryption key size requirement
	 */
	uint8_t encryptionKeySizeMin;

	/**
	 * maximum encryption key size requirement
	 */
	uint8_t encryptionKeySizeMax;

	/**
	 * fixed pin to be used in the pairing process if Use_Fixed_Pin is set to 1
	 */
	uint32_t Fixed_Pin;

	/**
	 * this flag indicates whether the host has to initiate the security, wait for pairing or does not have any security
	 * requirements.\n 0x00 : no security required 0x01 : host should initiate security by sending the slave security
	 * request command 0x02 : host need not send the clave security request but it has to wait for paiirng to complete
	 * before doing any other processing
	 */
	uint8_t initiateSecurity;
} tSecurityParams;

/**
 * global context contains the variables common to all services
 */
typedef struct _tBLEProfileGlobalContext
{

	/**
	 * security requirements of the host
	 */
	tSecurityParams bleSecurityParam;

	/**
	 * gap service handle
	 */
	uint16_t gapServiceHandle;

	/**
	 * device name characteristic handle
	 */
	uint16_t devNameCharHandle;

	/**
	 * appearance characteristic handle
	 */
	uint16_t appearanceCharHandle;

	/**
	 * connection handle of the current active connection When not in connection, the handle is set to 0xFFFF
	 */
	uint16_t connectionHandle;

	/**
	 * length of the UUID list to be used while advertising
	 */
	uint8_t advtServUUIDlen;

	/**
	 * the UUID list to be used while advertising
	 */
	uint8_t advtServUUID[100];

} BleGlobalContext_t;

typedef struct
{
	BleGlobalContext_t BleApplicationContext_legacy;
	APP_BLE_ConnStatus_t Device_Connection_Status;
	/**
	 * ID of the Advertising Timeout
	 */
	uint8_t Advertising_mgr_timer_Id;
} BleApplicationContext_t;

#define BD_ADDR_SIZE_LOCAL    6


typedef enum
{
	HCI_CMD_BUSY,
	HCI_CMD_AVAILABLE,
} HCI_CmdBusyStatus_t;

/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION( "MB_MEM1" ) ALIGN( 4 ) static TL_CmdPacket_t BleCmdBuffer;

static const uint8_t M_bd_addr[BD_ADDR_SIZE_LOCAL] = {
	( uint8_t )( ( CFG_ADV_BD_ADDRESS & 0x0000000000FF ) ),
	( uint8_t )( ( CFG_ADV_BD_ADDRESS & 0x00000000FF00 ) >> 8 ),
	( uint8_t )( ( CFG_ADV_BD_ADDRESS & 0x000000FF0000 ) >> 16 ),
	( uint8_t )( ( CFG_ADV_BD_ADDRESS & 0x0000FF000000 ) >> 24 ),
	( uint8_t )( ( CFG_ADV_BD_ADDRESS & 0x00FF00000000 ) >> 32 ),
	( uint8_t )( ( CFG_ADV_BD_ADDRESS & 0xFF0000000000 ) >> 40 )
};

static uint8_t bd_addr_udn[BD_ADDR_SIZE_LOCAL];

// Identity root key used to derive LTK and CSRK
static const uint8_t BLE_CFG_IR_VALUE[16] = CFG_BLE_IRK;

// Encryption root key used to derive LTK and CSRK
static const uint8_t BLE_CFG_ER_VALUE[16] = CFG_BLE_ERK;

PLACE_IN_SECTION( "BLE_APP_CONTEXT" ) static BleApplicationContext_t BleApplicationContext;


/* Global variables ----------------------------------------------------------*/
static CR_Queue* hci_user_evt_proc_flag;
static HCI_CmdBusyStatus_t hci_cmd_busy_status = HCI_CMD_AVAILABLE;

static BLE_Stack_Interface* m_ble_stack_interface_handler = nullptr;
static BLE_DCI_Interface* m_ble_dci_interface_handle = nullptr;

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void* pPayload );

static void BLE_StatusNot( HCI_TL_CmdStatus_t status );

static void Ble_Tl_Init( void );

static void Ble_Hci_Gap_Gatt_Init( void );

static const uint8_t* BleGetBdAddress( void );

static void BleErrorHandler( const char* msg );

static SVCCTL_EvtAckStatus_t Svc_Event_Handler( void* Event );

static void hci_user_evt_proc_task( CR_Tasker* cr_task, CR_TASKER_PARAM param );

