etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/STM32_WPAN_BF/stm32_wpan_app_ble.cpp
/*************************************************************
*   Initialization functions
*************************************************************/


void APP_BLE_Init( void )
{
	tBleStatus sensapp_status;

	/**
	 * Initialize Ble Transport Layer
	 */
	Ble_Tl_Init();

	/**
	 * Register the hci transport layer to handle BLE User Asynchronous Events
	 */
	hci_user_evt_proc_flag = new CR_Queue( 10 );
	new CR_Tasker( hci_user_evt_proc_task, NULL, CR_TASKER_PRIORITY_4, "hci_user_evt_proc_task" );
	/**
	 * Starts the BLE Stack on CPU2
	 */
	SHCI_C2_BLE_Init( m_ble_init_cmd_packet );

	/**
	 * Initialization of HCI & GATT & GAP layer
	 */
	Ble_Hci_Gap_Gatt_Init();

	/**
	 * Initialization of the BLE Services
	 */
	SVCCTL_Init();

	/**
	 * Initialization of the BLE App Context
	 */

	BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
	BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

	/**
	 * From here, all initialization are BLE application specific
	 */
	/**
	 * Register the service event handler to the BLE controller
	 */
	SVCCTL_RegisterSvcHandler( Svc_Event_Handler );

	/**
	 * Add GATT services
	 */

	sensapp_status = m_ble_dci_interface_handle->Init();

	if ( sensapp_status != BLE_STATUS_SUCCESS )
	{
		BleErrorHandler( "Error while adding services" );
	}

	// Start to advertise
	Adv_Request();

}

/*************************************************************
*   BLE status and event notifications
*************************************************************/

/**
 * @brief            Main BLE event handler
 * @param[in] pckt   Buffer holding the Event
 */
SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void* pckt )
{
	hci_event_pckt* event_pckt;
	evt_le_meta_event* meta_evt;
	evt_blue_aci* blue_evt;
	static uint16_t connection_handle;
	static uint8_t conn_update_status;

	event_pckt = ( hci_event_pckt* ) ( ( hci_uart_pckt* ) pckt )->data;

	switch ( event_pckt->evt )
	{

		case EVT_DISCONN_COMPLETE:
		{
			hci_disconnection_complete_event_rp0* disconnection_complete_event;
			disconnection_complete_event = ( hci_disconnection_complete_event_rp0* ) event_pckt->data;

			if ( disconnection_complete_event->Connection_Handle ==
				 BleApplicationContext.BleApplicationContext_legacy.connectionHandle )
			{
				BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
				BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
			}

			// Restart advertising
			Adv_Request();
		}
		break;

		case EVT_LE_META_EVENT:
		{
			meta_evt = ( evt_le_meta_event* ) event_pckt->data;
			switch ( meta_evt->subevent )
			{

				case EVT_LE_CONN_UPDATE_COMPLETE:
				{
					if ( conn_update_status == 1 )
					{
						tBleStatus res = aci_l2cap_connection_parameter_update_req( connection_handle, 0x06, 0x0A, 0x00,
																					200 );
						if ( res != BLE_STATUS_SUCCESS )
						{
							BleErrorHandler( "Parameters update request failed" );
						}
						else
						{
							conn_update_status++;
						}
					}
				}
				break;

				case EVT_LE_CONN_COMPLETE:
				{
					hci_le_connection_complete_event_rp0* connection_complete_event;
					connection_complete_event = ( hci_le_connection_complete_event_rp0* ) meta_evt->data;

					if ( BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING )
					{
						// Connection as client
						BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
					}
					else
					{
						// Connection as server
						BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
					}
					BleApplicationContext.BleApplicationContext_legacy.connectionHandle =
						connection_complete_event->Connection_Handle;

					conn_update_status = 0;
					connection_handle = connection_complete_event->Connection_Handle;
					tBleStatus res = aci_gatt_exchange_config( connection_complete_event->Connection_Handle );
					if ( res != BLE_STATUS_SUCCESS )
					{
						BleErrorHandler( "MTU update request failed" );
					}
					else
					{
						conn_update_status++;
					}
				}
				break;

				case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
					break;

				default:
					break;
			}
		}
		break;

		case EVT_VENDOR:
			blue_evt = ( evt_blue_aci* ) event_pckt->data;
			switch ( blue_evt->ecode )
			{
				case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
					break;

				default:
					break;
			}
			break;

		default:
			break;
	}

	return ( SVCCTL_UserEvtFlowEnable );
}

/**
 * @brief   Obtain the connection status
 * @return  Connection status
 */
APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status( void )
{
	return ( BleApplicationContext.Device_Connection_Status );
}

/**
 * @brief            GATT service event handler
 * @param[in] Event  Buffer holding the Event
 * @return           Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t Svc_Event_Handler( void* Event )
{
	SVCCTL_EvtAckStatus_t return_value;
	hci_event_pckt* event_pckt;
	evt_blue_aci* blue_evt;
	aci_gatt_attribute_modified_event_rp0* attribute_modified;
	aci_gatt_read_permit_req_event_rp0* read_permit_req = nullptr;
	aci_gatt_write_permit_req_event_rp0* write_permit_req = nullptr;

	return_value = SVCCTL_EvtNotAck;
	event_pckt = ( hci_event_pckt* )( ( ( hci_uart_pckt* )Event )->data );

	switch ( event_pckt->evt )
	{
		case EVT_VENDOR:
		{
			blue_evt = ( evt_blue_aci* )event_pckt->data;
			switch ( blue_evt->ecode )
			{
				case EVT_BLUE_GATT_ATTRIBUTE_MODIFIED:
				{
					uint8_t write_err_code = 0U;

					attribute_modified = ( aci_gatt_attribute_modified_event_rp0* )blue_evt->data;
					m_ble_stack_interface_handler->Write_Event( ( attribute_modified->Attr_Handle - 1U ),
																&( attribute_modified->Attr_Data[0] ),
																&write_err_code );
					break;
				}

				case EVT_BLUE_GATT_WRITE_PERMIT_REQ:
				{
					uint8_t write_err_code = 0U;
					bool process_ret = false;

					ErrorStatus write_status = SUCCESS;
					return_value = SVCCTL_EvtAckFlowEnable;
					write_permit_req = ( aci_gatt_write_permit_req_event_rp0* )blue_evt->data;
					process_ret =
						m_ble_stack_interface_handler->Write_Event( ( write_permit_req->Attribute_Handle - 1U ),
																	&( write_permit_req->Data[0] ),
																	&write_err_code );
					if ( process_ret == BLE_EVENT_ERROR )
					{
						write_status = ERROR;
						BleErrorHandler( "Error in Write_Event\n\r" );
					}
					aci_gatt_write_resp( write_permit_req->Connection_Handle,
										 write_permit_req->Attribute_Handle,
										 write_status,
										 write_err_code,
										 write_permit_req->Data_Length,
										 ( uint8_t* )&( write_permit_req->Data[0] ) );

					break;
				}

				case EVT_BLUE_GATT_READ_PERMIT_REQ:
				{
					uint8_t read_err_code = 0U;
					bool process_ret = false;

					read_permit_req = ( aci_gatt_read_permit_req_event_rp0* )blue_evt->data;
					process_ret = m_ble_stack_interface_handler->Read_Event( read_permit_req->Attribute_Handle - 1U,
																			 read_permit_req->Offset,
																			 &read_err_code );
					if ( process_ret == BLE_EVENT_SUCCESS )
					{
						( void )aci_gatt_allow_read( read_permit_req->Connection_Handle );
					}
					else
					{
						// error detected in offset calculation or read.
						BleErrorHandler( "Error in Read_Event\n\r" );
						read_permit_req->Offset = 0;
						( void )aci_gatt_deny_read( read_permit_req->Connection_Handle, read_err_code );
					}
					break;
				}

				case EVT_BLUE_GATT_NOTIFICATION:
				{
					break;
				}

				default:
					break;
			}
		}
		break;	/* HCI_EVT_VENDOR_SPECIFIC */

		default:
			break;
	}
	return ( return_value );
}

/**
 * @brief    Initialize the low-level transport layer for BLE
 */
static void Ble_Tl_Init( void )
{
	HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

