etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/STM32_WPAN_BF/stm32_wpan_app_ble.cpp
	Hci_Tl_Init_Conf.p_cmdbuffer = ( uint8_t* )&BleCmdBuffer;
	Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
	hci_init( BLE_UserEvtRx, ( void* ) &Hci_Tl_Init_Conf );
	return;
}

/**
 * @brief    Initialize the HCI, GAP, and GATT layers.
 */
static void Ble_Hci_Gap_Gatt_Init( void )
{

	uint8_t role;
	uint8_t index;
	uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
	const uint8_t* bd_addr;
	uint32_t srd_bd_addr[2];
	uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE };

	/**
	 * Initialize HCI layer
	 */
	/*HCI Reset to synchronise BLE Stack*/
	hci_reset();

	/**
	 * Write the BD Address
	 */
	bd_addr = BleGetBdAddress();
	aci_hal_write_config_data( CONFIG_DATA_PUBADDR_OFFSET,
							   CONFIG_DATA_PUBADDR_LEN,
							   ( uint8_t* ) bd_addr );

	// Write Identity root key used to derive LTK and CSRK
	aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN,
							   ( uint8_t* ) BLE_CFG_IR_VALUE );

	// Write Encryption root key used to derive LTK and CSRK
	aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN,
							   ( uint8_t* ) BLE_CFG_ER_VALUE );

	// Write random bd_address
	/*
	   random_bd_address = R_bd_address;
	   aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_WR, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)
	      random_bd_address);
	 */

	/**
	 * Static random Address The two upper bits shall be set to 1 The lowest 32bits is read from the UDN to
	 * differentiate between devices The RNG may be used to provide a random number on each power on
	 */
	srd_bd_addr[1] = 0x0000ED6E;
	srd_bd_addr[0] = LL_FLASH_GetUDN();
	aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN,
							   ( uint8_t* )srd_bd_addr );
	/**
	 * Write Identity root key used to derive LTK and CSRK
	 */
	aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, ( uint8_t* )BLE_CFG_IR_VALUE );

	/**
	 * Write Encryption root key used to derive LTK and CSRK
	 */
	aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, ( uint8_t* )BLE_CFG_ER_VALUE );

	/**
	 * Set TX Power to 0dBm.
	 */
	aci_hal_set_tx_power_level( 1, CFG_TX_POWER );

	/**
	 * Initialize GATT interface
	 */
	aci_gatt_init();

	/**
	 * Initialize GAP interface
	 */
	role = 0;

#if ( BLE_CFG_PERIPHERAL == 1 )
	role |= GAP_PERIPHERAL_ROLE;
#endif

#if ( BLE_CFG_CENTRAL == 1 )
	role |= GAP_CENTRAL_ROLE;
#endif

	if ( role > 0 )
	{
		aci_gap_init( role, PRIVACY_DISABLED, m_device_name_length,
					  &gap_service_handle, &gap_dev_name_char_handle, &gap_appearance_char_handle );

		if ( aci_gatt_update_char_value( gap_service_handle, gap_dev_name_char_handle, 0, strlen( m_device_name ),
										 ( uint8_t* ) m_device_name ) )
		{
			BleErrorHandler( "Device Name aci_gatt_update_char_value failed.\n\r" );
		}
	}

	if ( aci_gatt_update_char_value( gap_service_handle, gap_appearance_char_handle,
									 0, 2, ( uint8_t* )&appearance ) )
	{
		BleErrorHandler( "Appearance aci_gatt_update_char_value failed.\n\r" );
	}

	// Initialize Default PHY
	hci_le_set_default_phy( ALL_PHYS_PREFERENCE, TX_2M_PREFERRED, RX_2M_PREFERRED );

	// Initialize IO capability
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability = CFG_IO_CAPABILITY;
	aci_gap_set_io_capability( BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability );

	// Initialize authentication
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode = CFG_MITM_PROTECTION;
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.OOB_Data_Present = 0;
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin = 8;
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax = 16;
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin = CFG_USED_FIXED_PIN;
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin = CFG_FIXED_PIN;
	BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode = 1;
	for ( index = 0; index < 16; index++ )
	{
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.OOB_Data[index] = ( uint8_t ) index;
	}

	aci_gap_set_authentication_requirement(
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
		CFG_SC_SUPPORT,
		0,
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
		BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin,
		0
		);

	/**
	 * Initialize whitelist
	 */
	if ( BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode )
	{
		aci_gap_configure_whitelist();
	}
}

/**
 * @brief             Start the BLE adveritising. Stop the advertising by calling aci_gap_set_non_discoverable();
 */
void Adv_Request( void )
{
	tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

	// Start advertising
	BleApplicationContext.Device_Connection_Status = APP_BLE_FAST_ADV;
	/* Start Fast or Low Power Advertising */
	ret = aci_gap_set_discoverable(
		ADV_IND,
		CFG_CONN_ADV_INTERVAL_MIN,
		CFG_CONN_ADV_INTERVAL_MAX,
		PUBLIC_ADDR,
		NO_WHITE_LIST_USE,	// use/not use white list
		0,
		0,
		0,
		0,
		0,
		0 );
	// Update Advertising data
	ret = aci_gap_update_adv_data( m_ad_data_size, ( uint8_t* ) m_ad_data );

	if ( ret != BLE_STATUS_SUCCESS )
	{
		BleErrorHandler( "Start advertising failed" );
	}

	return;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Adv_Stop( void )
{
	aci_gap_set_non_discoverable();

	// Set the TX Power back to default.
	aci_hal_set_tx_power_level( 1, CFG_TX_POWER );
}

