etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/STM32_WPAN_BF/stm32_wpan_app_ble.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Set_TX_Power( uint8_t tx_power_level )
{
	aci_hal_set_tx_power_level( 0, tx_power_level );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Discovery_Request( void )
{
	tBleStatus status = 0xFF;
	static int Start_Discovery_Failure_Count = 0;
	static int Start_Discovery_Success_Count = 0;

	if ( ( BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE ) ||
		 ( BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV ) )
	{
		status = aci_gap_start_general_discovery_proc( LE_SCAN_INTERVAL, LE_SCAN_WINDOW, PUBLIC_ADDR, 0x00 );

		if ( status != BLE_STATUS_SUCCESS )
		{
			Start_Discovery_Failure_Count++;
		}
		else
		{
			Start_Discovery_Success_Count++;
		}
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stop_Discovery( void )
{
	tBleStatus status;
	static int Stop_Discovery_Failure_Count = 0;
	static int Stop_Discovery_Success_Count = 0;

	status = aci_gap_terminate_gap_proc( GAP_GENERAL_DISCOVERY_PROC );

	if ( status != BLE_STATUS_SUCCESS )
	{
		Stop_Discovery_Failure_Count++;
	}
	else
	{
		Stop_Discovery_Success_Count++;
	}
}

/*************************************************************
*   Utility functions
*************************************************************/

/**
 * @brief   Get the Bluetooth address
 * @return  Bluetooth device address
 */
static const uint8_t* BleGetBdAddress( void )
{
	uint8_t* otp_addr;
	const uint8_t* bd_addr;
	uint32_t udn;
	uint32_t company_id;
	uint32_t device_id;

	udn = LL_FLASH_GetUDN();

	if ( udn != 0xFFFFFFFF )
	{
		company_id = LL_FLASH_GetSTCompanyID();
		device_id = LL_FLASH_GetDeviceID();

		bd_addr_udn[0] = ( uint8_t )( udn & 0x000000FF );
		bd_addr_udn[1] = ( uint8_t )( ( udn & 0x0000FF00 ) >> 8 );
		bd_addr_udn[2] = ( uint8_t )( ( udn & 0x00FF0000 ) >> 16 );
		bd_addr_udn[3] = ( uint8_t )device_id;
		bd_addr_udn[4] = ( uint8_t )( company_id & 0x000000FF );
		bd_addr_udn[5] = ( uint8_t )( ( company_id & 0x0000FF00 ) >> 8 );

		bd_addr = ( const uint8_t* )bd_addr_udn;
	}
	else
	{
		otp_addr = OTP_Read( 0 );
		if ( otp_addr )
		{
			bd_addr = ( ( OTP_ID0_t* )otp_addr )->bd_address;
		}
		else
		{
			bd_addr = M_bd_addr;
		}
	}

	return ( bd_addr );
}

/**
 * @brief             Handles errors happening in this file
 * @param[in] msg     Error message
 */
void BleErrorHandler( const char* msg )
{
	// TODO: report as preferred
	return;
}

/*************************************************************
*   HCI event callbacks
*************************************************************/

/**
 * @brief    Receive notifications of HCI events from the stack. It needs to trigger hci_user_evt_proc to run via the
 * task manager.
 * @remark   This function runs only after APP_BLE_Init, which runs only after receiving an SHCI event, which is
 * processed (in shci_notify_asynch_evt_callback) only when the OS is running.
 * @remark   The number of concurrent HCI events is low, the queue can be set to a relatively small size (e.g., 10
 * elements) without worrying to make the queue full.
 */
void hci_notify_asynch_evt( void* pdata )
{
	// coverity[var_deref_model]
	hci_user_evt_proc_flag->Send( NULL, 0 );
	return;
}

/**
 * @brief    Processes HCI events received from the BLE stack by calling hci_user_evt_proc().
 */
static void hci_user_evt_proc_task( CR_Tasker* cr_task, CR_TASKER_PARAM param )
{
	volatile static CR_QUEUE_STATUS status;
	static uint32_t queue_receive;

	CR_Tasker_Begin( cr_task );
	for (;;)
	{
		CR_Queue_Receive( cr_task, hci_user_evt_proc_flag, ( CR_RX_QUEUE_DATA )&queue_receive, 1000, status );
		if ( CR_QUEUE_PASS == status )
		{
			while ( hci_cmd_busy_status == HCI_CMD_BUSY )
			{
				CR_Tasker_Yield( cr_task );
			}
			hci_user_evt_proc();
		}
	}
	CR_Tasker_End();
}

/**
 * See declaration in hci_tl.h. This functions is weakly implemented in hci_tl.c but it has been reimplemented for
 * better performance.
 */
void hci_cmd_resp_release( uint32_t flag )
{
	HAL_HSEM_Release( HCI_CMD_RESP_HSEM, 0 );
}

/**
 * See declaration in hci_tl.h. This function must block if the response has not been released. This functions is weakly
 * implemented in hci_tl.c but it has been reimplemented for better performance.
 */
void hci_cmd_resp_wait( uint32_t timeout )
{
	HAL_HSEM_FastTake( HCI_CMD_RESP_HSEM );
	while ( HAL_HSEM_IsSemTaken( HCI_CMD_RESP_HSEM ) )
	{
		continue;
	}
}

/**
 * @brief               User event handler
 * @param[in] pPayload  Event payload
 */
static void BLE_UserEvtRx( void* pPayload )
{
	SVCCTL_UserEvtFlowStatus_t svctl_return_status;
	tHCI_UserEvtRxParam* pParam;

	pParam = ( tHCI_UserEvtRxParam* )pPayload;

	svctl_return_status = SVCCTL_UserEvtRx( ( void* )&( pParam->pckt->evtserial ) );
	if ( svctl_return_status != SVCCTL_UserEvtFlowDisable )
	{
		pParam->status = HCI_TL_UserEventFlow_Enable;
	}
	else
	{
		pParam->status = HCI_TL_UserEventFlow_Disable;
	}
}

/*
 * See declaration for function definition.
 */
static void BLE_StatusNot( HCI_TL_CmdStatus_t status )
{
	switch ( status )
	{
		case HCI_TL_CmdBusy:
			/*
			 *	Signal to all tasks that may send an aci/hci commands to block. This is to prevent sending a new command
			 * while one is already pending.
			 */

			hci_cmd_busy_status = HCI_CMD_BUSY;
			break;

		case HCI_TL_CmdAvailable:
			// Signal to all tasks that may send an aci/hci commands that they can continue.
			hci_cmd_busy_status = HCI_CMD_AVAILABLE;
			break;

		default:
			break;
	}
}

/*
 * See declaration for function definition.
 */
void SVCCTL_ResumeUserEventFlow( void )
{
	hci_resume_flow();
}

/**
 * @brief			Get_Max_BLE_Server_Buffer_Size
 * @param[out]		Max Communication buffer
 */
uint16_t Get_Max_BLE_Server_Buffer_Size( void )
{
	return ( MAX_BUFFER );	// TODO:Should be a negotiated value and should not be more than log data dcid length
}

/**
 * @brief			Application updates the handles and other parameters for the dci and stack interface files.
 * @param[in]		ble_dci_interface_handle
 * @param[in]		ble_stack_interface_handler
 * @param[in]		ad_data
 * @param[in]		ad_data_size
 * @param[in]		device_name
 * @param[in]		device_name_length
 * @param[in]		ble_init_cmd_packet
 */
void Init_Interface_Parameters( BLE_DCI_Interface* ble_dci_interface_handle,
								BLE_Stack_Interface* ble_stack_interface_handler, uint8_t const* ad_data,
								uint8_t ad_data_size, const char* device_name, uint8_t device_name_length,
								SHCI_C2_Ble_Init_Cmd_Packet_t* ble_init_cmd_packet )
{
	m_ble_dci_interface_handle = ble_dci_interface_handle;
	m_ble_stack_interface_handler = ble_stack_interface_handler;
	m_ad_data = ad_data;
	m_device_name_length = device_name_length;
	m_ad_data_size = ad_data_size;
	m_device_name = device_name;
	m_ble_init_cmd_packet = ble_init_cmd_packet;
}

/**
 * @brief			Returns BLE Stack interface handle
 * @param[out]		Handle
 */
BLE_Stack_Interface* Get_BLE_Stack_Interface_Handle( void )
{
	return ( m_ble_stack_interface_handler );
}
